Prova jupyter

In [ ]:
import pandas as pd
import numpy as np

file_path = "ex1.csv"

df = pd.read_csv(file_path)

df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
print(df.head())

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
import pandas as pd
import numpy as np

obj = pd.Series([4,7,-5,3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [7]:
obj2 = pd.Series([4,7,-5,3], index = ["a","b","c","d"])

obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [8]:
obj2[obj2 >0]

a    4
b    7
d    3
dtype: int64

In [9]:
obj2 *2

a     8
b    14
c   -10
d     6
dtype: int64

In [10]:
"b" in obj2

True

In [12]:
sdata = {"Ohio" : 35000, "Texas" : 71000, "Oregon" : 16000, "Utah" : 5000}

obj3 = pd.Series(sdata)

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [13]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
states = ["California", "Ohio", "Oregon","Texas"]

obj4 = pd.Series(sdata, index = states)

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
pd.isna(obj4)
pd.notna(obj4)
obj4.isna()
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
data = {"state":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
        "year":[2000,2001,2002,2003],
        "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}


data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

TUTTE LE COLONNE DEVONO AVERE LA STESSA LUNGHEZZA!

In [25]:
frame = pd.DataFrame(data)

ValueError: All arrays must be of the same length

In [26]:
data = {"state":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
        "year":[2000,2001,2002,2001,2002,2003],
        "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}

frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [30]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [34]:
frame2 = pd.DataFrame(data, columns = ["year","state","pop","debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [35]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [37]:
#Ovviamente questo funziona solo se il nome della colonna non è uguale a un metodo già esistente o se la colonna esiste
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [38]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [39]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

La differenza tra .loc e .iloc sta nel modo in cui vanno ad individuare gli elementi. iloc va in base alla posizione, loc li richiama in base al label. in questo caso label e posizione coincidono

In [41]:
obj2.loc["b"]

np.int64(7)

In [42]:
obj2.iloc[1]

np.int64(7)

In [44]:
frame2["debt"] = 16.5

frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [46]:
frame2["dell"] = np.arange(6)

frame2

   year   state  pop  debt  dell
0  2000    Ohio  1.5  16.5     0
1  2001    Ohio  1.7  16.5     1
2  2002    Ohio  3.6  16.5     2
3  2001  Nevada  2.4  16.5     3
4  2002  Nevada  2.9  16.5     4
5  2003  Nevada  3.2  16.5     5

In [52]:
del frame2["dell"]

frame2

KeyError: 'dell'

Crea un dataframe con numeri casuali

In [60]:
col1 = pd.Series([np.random.randint(1,100) for el in range(10)])
col2 = pd.Series([np.random.randint(1,100) for el in range(10)])
col3 = pd.Series([np.random.randint(1,100) for el in range(10)])
col4 = pd.Series([np.random.randint(1,100) for el in range(10)])
col5 = pd.Series([np.random.randint(1,100) for el in range(10)])

data1 = {"1": col1, "2" : col2, "3": col3, "4" : col4, "5" : col5}

dataframe = pd.DataFrame(data1)

dataframe

    1   2   3   4   5
0  14  29  66  51   7
1  83  35  39  45  74
2  50  14  55  85   7
3  13  59  26   5  52
4  71  41  55  88  62
5  66  32  24  28  47
6  55   2  66   8   3
7  53  28  83  23  36
8  13  83  42  71  62
9  68  89  44   9  41

In [ ]:
array = np.random.random_integers(0,1000, (10,3))

df = pd.DataFrame(array)

df

C:\Users\stefano\AppData\Local\Temp\ipykernel_4532\2129043214.py:1: DeprecationWarning: This function is deprecated. Please call randint(0, 1000 + 1) instead
  array = np.random.random_integers(0,1000, (10,3))

     0    1    2
0   84  451  885
1  127  952   38
2  859   86  423
3  943  394  443
4  339  899  951
5  642  718  856
6  863  477  779
7  323  987  432
8   66  430  136
9  666  994  416

In [61]:
population = {"Ohio":{2000 : 1.5, 2001 : 1.7, 2002:3.6},
              "Nevada":{2001:2.4, 2002: 2.9}}
frame3 = pd.DataFrame(population)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [62]:
frame3.index.name = "years"
frame3.columns.name = "states"

frame3

states  Ohio  Nevada
years
2000     1.5     NaN
2001     1.7     2.4
2002     3.6     2.9

In [64]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index = ["d","b","a","c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [66]:
obj2 = obj.reindex(["a","b","c","d"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [67]:
obj3 = pd.Series(["blue","purple","yellow"], index = [0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

Il metodo "ffill" riempe i buchi con i dati precedenti

In [68]:
obj3.reindex(np.arange(6),method = "ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [70]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [89]:
serie = pd.Series(np.random.randint(1,100,15))

casuali = np.random.choice(range(10), 3, replace=False)

for i in casuali:
    serie[i] = np.nan

serie1 = serie.ffill()

serie1

0     42.0
1     42.0
2      1.0
3     45.0
4     32.0
5     43.0
6     43.0
7     43.0
8     58.0
9     41.0
10    46.0
11    71.0
12    23.0
13    29.0
14    74.0
dtype: float64

In [91]:
df = pd.DataFrame([[1.4, np.nan], [7.1,-4.5], [np.nan, np.nan], [0.75, -1.3]], index=["a", "b", "c", "d"], columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [92]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [ ]:
df.sum(axis = "columns") #la somma di due NaN è 0

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [ ]:
df.sum(axis = "columns", skipna = False) #somma numero e Nan è NaN

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [96]:
df.idxmax()

one    b
two    d
dtype: object

In [98]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [97]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000